// Определить количество цифр в числе
//git push https://ghp_bA2****************3vtX0M@github.com/AlexBulavin/CSharpStudy.git
Console.Write("\nВведите натуральное число N: ");
int N = Console.ReadLine().Length;
Console.WriteLine(N);